_Rarzrabotki/Rarus/USO2/AccumulationRegisters/уатОстаткиГСМнаТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>уатОстаткиГСМнаТС</Name>
			<Comment>(уат)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьУпр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГСМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Колонна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатКолонны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатВводОстатковГСМ</v8:Type>
						<v8:Type>cfg:DocumentRef.уатЗаправкаГСМ</v8:Type>
						<v8:Type>cfg:DocumentRef.уатСливГСМ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/уатНоменклатураГСМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>уатНоменклатураГСМ</Name>
			<Comment>Доп. сведения для ГСМ</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВестиУчетОстатковТЖ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаГСМ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатГруппыГСМ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГСМТалона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛитровыйТалон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НоминалТалона</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Плотность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/уатМестонахождениеТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>уатМестонахождениеТС</Name>
			<Comment>(уат)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Колонна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатКолонны</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/уатНормыРасходаГСМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>уатНормыРасходаГСМ</Name>
			<Comment>(уат)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЛинейнаяНорма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаЕздку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаЗапуск</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаИзменениеСобственногоВеса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаОперацию</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаОтопитель</Name>
					<Comment>Норма на отопитель, кондиционер, климат-контроль</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаПростойСВклДвигателем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаПростойСВклДвигателемЛитры</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаПростойСВклДвигателемПроцентомОтБазовой</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота4</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота5</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота6</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота7</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота8</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота9</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота10</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу4</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу5</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу6</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу7</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу8</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу9</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу10</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаТранспортнуюРаботу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаСпециальнаяНаМоточас</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СезоннаяНадбавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НадбавкаНаКондиционер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьПростоиДляРасчетаНормыМоточасов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АлгоритмРасчета</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ГСМ</Name>
					<Comment>ГСМ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МодельТС</Name>
					<Comment>Модель ТС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
						<v8:Type>cfg:CatalogRef.уатМоделиТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/CommonModules/уатГСМ/Ext/Module.bsl
// Возвращает результат запроса по остаткам ГСМ по партиям
//
//
Функция ПолучитьОстаткиПартийГСМ(МоментВремени, СпособОценкиМПЗ, ТС, ГСМ)
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОстаткиГСМ.Партия КАК Партия,
	|	ОстаткиГСМ.ТС КАК ТС,
	|	ОстаткиГСМ.ГСМ КАК ГСМ,
	|	ОстаткиГСМ.Колонна КАК Колонна,
	|	ОстаткиГСМ.Организация КАК Организация,
	|	ОстаткиГСМ.Подразделение КАК Подразделение,
	|	ЕСТЬNULL(ОстаткиГСМ.КоличествоОстаток, 0) КАК Количество,
	|	ОстаткиГСМ.СтоимостьОстаток КАК Стоимость,
	|	ОстаткиГСМ.СтоимостьУпрОстаток КАК СтоимостьУпр
	|ИЗ
	|	РегистрНакопления.уатОстаткиГСМнаТС.Остатки(
	|		&Момент,
	|		ГСМ В (&ГСМ) И ТС = &ТС) КАК ОстаткиГСМ
	|ГДЕ
	|	ОстаткиГСМ.КоличествоОстаток > 0
	|";
	
	Если СпособОценкиМПЗ = Перечисления.СпособыОценки.ФИФО Тогда
		Запрос.Текст = Запрос.Текст + "
		|УПОРЯДОЧИТЬ ПО	ОстаткиГСМ.Партия.Дата ВОЗР";
	ИначеЕсли СпособОценкиМПЗ = Перечисления.СпособыОценки.ЛИФО Тогда
		Запрос.Текст = Запрос.Текст + "
		|УПОРЯДОЧИТЬ ПО	ОстаткиГСМ.Партия.Дата УБЫВ";
	КонецЕсли;
	
	//получаем аналоги
	тзАналогиГСМ = уатОбщегоНазначения.уатПолучитьАналогиГСМ(ГСМ);
	
	//добавляем к аналогам основное ГСМ
	НоваяСтрока = тзАналогиГСМ.Добавить();
	НоваяСтрока.ГСМ = ГСМ;
	НоваяСтрока.Аналог = ГСМ;
	
	Запрос.УстановитьПараметр("Момент", МоментВремени);
	Запрос.УстановитьПараметр("ГСМ", тзАналогиГСМ.ВыгрузитьКолонку("Аналог"));
	Запрос.УстановитьПараметр("ТС", ТС);
	
	Возврат Запрос.Выполнить();
КонецФункции

//Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоГСМ - результат запроса по табличной части "Материалы",
//  ТаблицаДляСписанияГСМ - Сформированная таблица значений,
//  ПоДокументу - булево, Истина - берем данные из документа и рассчитываем стоимость. Ложь - читаем данные из регистра
//
// Возвращаемое значение:
//  Сформированная таблица значений.
//
Функция ПодготовитьТаблицуСписанияГСМ(ДокументОбъект, ТаблицаДляСписанияГСМ, ПоДокументу, вхСредняяЦена = 0, СтрокаОшибки = "") Экспорт
	
	Перем мСписаноКоличество;
	Перем мСписаноСтоимость;
	
	ВсеОК = Истина;
	мСписаноКоличество = 0;
	мСписаноСтоимость  = 0;
	
	ТаблицаДляСписанияГСМ = Новый ТаблицаЗначений;
	ТаблицаДляСписанияГСМ.Колонки.Добавить("Партия");
	ТаблицаДляСписанияГСМ.Колонки.Добавить("Дата");
	ТаблицаДляСписанияГСМ.Колонки.Добавить("Склад");
	ТаблицаДляСписанияГСМ.Колонки.Добавить("ГСМ");
	ТаблицаДляСписанияГСМ.Колонки.Добавить("Номенклатура");
	ТаблицаДляСписанияГСМ.Колонки.Добавить("ТС");
	ТаблицаДляСписанияГСМ.Колонки.Добавить("Колонна");
	ТаблицаДляСписанияГСМ.Колонки.Добавить("Организация");
	ТаблицаДляСписанияГСМ.Колонки.Добавить("Подразделение");
	ТаблицаДляСписанияГСМ.Колонки.Добавить("Количество");
	ТаблицаДляСписанияГСМ.Колонки.Добавить("Коэффициент");
	ТаблицаДляСписанияГСМ.Колонки.Добавить("Сумма");
	ТаблицаДляСписанияГСМ.Колонки.Добавить("СтоимостьУпр");
	ТаблицаДляСписанияГСМ.Колонки.Добавить("Стоимость");
	
	Если ПоДокументу Тогда
		//заполняем таблицу по данным документа. Рассчитываем стоимость ГСМ
		// получим результат запроса по таблице ГСМ в пут. листе
		РезультатЗапросаПоГСМ = Новый Запрос();
		
		МоментВремениОстПартий = ДокументОбъект.МоментВремени();
		
		Если ТипЗнч(ДокументОбъект) = Тип("ДокументСсылка.уатПутевойЛист") Тогда
			
			РезультатЗапросаПоГСМ.Текст	=
			"ВЫБРАТЬ
			|	уатПутевойЛистРасходГСМ.ГСМ,
			|	уатПутевойЛистРасходГСМ.РасходПоФакту КАК СписываемоеКоличество,
			|	уатПутевойЛистРасходГСМ.ТС,
			|	уатПутевойЛистРасходГСМ.Ссылка.ДатаЗакрытия КАК Дата,
			|	уатМестонахождениеТС.Колонна
			|ИЗ
			|	Документ.уатПутевойЛист.РасходГСМ КАК уатПутевойЛистРасходГСМ
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уатНоменклатураГСМ КАК уатНоменклатураГСМ
			|		ПО уатПутевойЛистРасходГСМ.ГСМ = уатНоменклатураГСМ.Номенклатура
			|			И (уатНоменклатураГСМ.ГруппаГСМ = &ГруппаГСМ)
			|	ЛЕВОЕ СОЕДИНЕНИЕ
			|	РегистрСведений.уатМестонахождениеТС.СрезПоследних(&Дата) КАК уатМестонахождениеТС
			|	ПО уатПутевойЛистРасходГСМ.ТС = уатМестонахождениеТС.ТС
			|ГДЕ
			|	уатПутевойЛистРасходГСМ.Ссылка = &Ссылка
			|	И уатПутевойЛистРасходГСМ.Активен = &Активен";
			РезультатЗапросаПоГСМ.УстановитьПараметр("Активен", Истина);
			РезультатЗапросаПоГСМ.УстановитьПараметр("Ссылка", ДокументОбъект.Ссылка);
			РезультатЗапросаПоГСМ.УстановитьПараметр("ГруппаГСМ", Перечисления.уатГруппыГСМ.Топливо);
			РезультатЗапросаПоГСМ.УстановитьПараметр("Дата", ДокументОбъект.МоментВремени());
			тблВыборкаЗапросаПоГСМ = РезультатЗапросаПоГСМ.Выполнить().Выгрузить();
			
			Если ЗначениеЗаполнено(ДокументОбъект.ДатаЗакрытия) Тогда
				МоментВремениОстПартий = Новый Граница(ДокументОбъект.ДатаЗакрытия, ВидГраницы.Исключая);
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.уатПутевойЛист") Тогда
			
			тблВыборкаЗапросаПоГСМ = ДокументОбъект.РасходГСМ.Выгрузить();
			тблВыборкаЗапросаПоГСМ.Колонки.Добавить("Дата");
			тблВыборкаЗапросаПоГСМ.Колонки.РасходПоФакту.Имя = "СписываемоеКоличество";
			тблВыборкаЗапросаПоГСМ.ЗаполнитьЗначения(ДокументОбъект.ДатаЗакрытия, "Дата");
			//добавление колонны
			тблВыборкаЗапросаПоГСМ.Колонки.Добавить("Колонна");
			Для Каждого ТекСтрока Из тблВыборкаЗапросаПоГСМ Цикл
				ТекСтрока.Колонна = уатОбщегоНазначения.МестонахождениеТС(ТекСтрока.ТС, ДокументОбъект.МоментВремени()).Колонна;
			КонецЦикла;
			
			Если ЗначениеЗаполнено(ДокументОбъект.ДатаЗакрытия) Тогда
				МоментВремениОстПартий = Новый Граница(ДокументОбъект.ДатаЗакрытия, ВидГраницы.Исключая);
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.уатСливГСМ") ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументСсылка.уатСливГСМ") Тогда
			РезультатЗапросаПоГСМ.Текст	=
			"ВЫБРАТЬ
			|	уатСливГСМ.ТС,
			|	уатСливГСМ.ГСМ,
			|	уатСливГСМ.АЗС.Контрагент_Склад КАК Склад,
			|	уатСливГСМ.Количество КАК СписываемоеКоличество,
			|	уатСливГСМ.Количество КАК Количество,
			|	&Коэффициент КАК Коэффициент,
			|	уатСливГСМ.Дата,
			|	уатМестонахождениеТС.Колонна
			|ИЗ
			|	Документ.уатСливГСМ КАК уатСливГСМ
			|	ЛЕВОЕ СОЕДИНЕНИЕ
			|	РегистрСведений.уатМестонахождениеТС.СрезПоследних(&Дата) КАК уатМестонахождениеТС
			|	ПО уатСливГСМ.ТС = уатМестонахождениеТС.ТС
			|
			|ГДЕ
			|	уатСливГСМ.Ссылка = &Ссылка";
			РезультатЗапросаПоГСМ.УстановитьПараметр("Коэффициент", 1);
			РезультатЗапросаПоГСМ.УстановитьПараметр("Дата", ДокументОбъект.МоментВремени());
			РезультатЗапросаПоГСМ.УстановитьПараметр("Ссылка",ДокументОбъект.Ссылка);
			тблВыборкаЗапросаПоГСМ = РезультатЗапросаПоГСМ.Выполнить().Выгрузить();
			
		КонецЕсли;	
		
		СпособОценкиМПЗ = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(ДокументОбъект.Организация, ПланыВидовХарактеристик.уатПраваИНастройки.СпособОценкиМПЗ);
		
		//Перебираем строки ГСМ, который надо списать
		Для Каждого ВыборкаЗапросаПоГСМ Из тблВыборкаЗапросаПоГСМ Цикл
			НадоСписатьКоличество = ВыборкаЗапросаПоГСМ.СписываемоеКоличество;
			
			//Получение остатков ГСМ по партиям
			РезультатЗапросаПартииГСМ = ПолучитьОстаткиПартийГСМ(МоментВремениОстПартий, СпособОценкиМПЗ, ВыборкаЗапросаПоГСМ.ТС, ВыборкаЗапросаПоГСМ.ГСМ);
			ВыборкаЗапросаПартииГСМ		= РезультатЗапросаПартииГСМ.Выбрать();
			
			//КоличествоОстаток = уатОстатокГСМнаТС(ДокументОбъект.МоментВремени(),
			//	ВыборкаЗапросаПоГСМ.ТС, ВыборкаЗапросаПоГСМ.ГСМ);
			//Если НадоСписатьКоличество > КоличествоОстаток Тогда
			//	//Расход по ТС превышает остаток
			//	ВсеОК=Ложь;
			//	СтрокаОшибки = СтрокаОшибки + Символы.ПС + "Надо списать: " + НадоСписатьКоличество
			//		+ ", остаток: " + КоличествоОстаток;
			//КонецЕсли; 
			
			Если ВсеОК Тогда
				
				НадоСписатьСумму = 0;
				НадоСписатьСуммуУпр = 0;
				Если СпособОценкиМПЗ = Перечисления.СпособыОценки.ПоСредней Тогда
					Попытка
						мТаблицаДляСуммы	= РезультатЗапросаПартииГСМ.Выгрузить();
						НадоСписатьСумму = мТаблицаДляСуммы.Итог("Стоимость") / мТаблицаДляСуммы.Итог("Количество") * НадоСписатьКоличество;
						НадоСписатьСуммуУпр = мТаблицаДляСуммы.Итог("СтоимостьУпр") / мТаблицаДляСуммы.Итог("Количество") * НадоСписатьКоличество;
					Исключение
					КонецПопытки;	
				КонецЕсли;
				
				Пока НадоСписатьКоличество > 0 Цикл
					Если ВыборкаЗапросаПартииГСМ.Следующий() Тогда
						мКоличество = Мин(НадоСписатьКоличество, ВыборкаЗапросаПартииГСМ.Количество);
						мКоличество = ?(мКоличество < 0, 0, мКоличество);
						
						Если СпособОценкиМПЗ = Перечисления.СпособыОценки.ПоСредней Тогда
							мСтоимость = Мин(НадоСписатьСумму, ВыборкаЗапросаПартииГСМ.Стоимость);
							мСтоимостьУпр = Мин(НадоСписатьСуммуУпр, ВыборкаЗапросаПартииГСМ.СтоимостьУпр);
						Иначе
							Если ВыборкаЗапросаПартииГСМ.Количество = 0 Или ВыборкаЗапросаПартииГСМ.Количество < НадоСписатьКоличество Тогда
								мСтоимость = ВыборкаЗапросаПартииГСМ.Стоимость;
								мСтоимостьУпр = ВыборкаЗапросаПартииГСМ.СтоимостьУпр;
							Иначе	
								мСтоимость = НадоСписатьКоличество * ВыборкаЗапросаПартииГСМ.Стоимость / ВыборкаЗапросаПартииГСМ.Количество;
								мСтоимостьУпр = НадоСписатьКоличество * ВыборкаЗапросаПартииГСМ.СтоимостьУпр / ВыборкаЗапросаПартииГСМ.Количество;
								//мСтоимостьУпр = мСтоимость;
							КонецЕсли;
							
						КонецЕсли;      
						
						Если мКоличество > 0 Тогда
							НоваяСтрока = ТаблицаДляСписанияГСМ.Добавить();
							НоваяСтрока.ТС = ВыборкаЗапросаПоГСМ.ТС;
							НоваяСтрока.Дата = ВыборкаЗапросаПоГСМ.Дата;
							НоваяСтрока.Партия = ВыборкаЗапросаПартииГСМ.Партия;
							НоваяСтрока.ГСМ = ВыборкаЗапросаПартииГСМ.ГСМ;
							НоваяСтрока.Колонна = ВыборкаЗапросаПартииГСМ.Колонна;
							НоваяСтрока.Организация = ВыборкаЗапросаПартииГСМ.Организация;
							НоваяСтрока.Подразделение = ВыборкаЗапросаПартииГСМ.Подразделение;
							НоваяСтрока.Количество = мКоличество;
							НоваяСтрока.Стоимость = мСтоимость;	
							НоваяСтрока.СтоимостьУпр = мСтоимостьУпр;
							
							Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.уатСливГСМ") Тогда
								
								НоваяСтрока.Склад		= ВыборкаЗапросаПоГСМ.Склад;
								НоваяСтрока.Номенклатура= ВыборкаЗапросаПартииГСМ.ГСМ;
								НоваяСтрока.Сумма		= мСтоимость;
								НоваяСтрока.Коэффициент	= ВыборкаЗапросаПоГСМ.Коэффициент;
								
							КонецЕсли;	
							
							мСписаноКоличество 		= мСписаноКоличество + НоваяСтрока.Количество;
							мСписаноСтоимость 		= мСписаноСтоимость + НоваяСтрока.Стоимость;
						КонецЕсли;
						
						НадоСписатьКоличество = НадоСписатьКоличество - мКоличество;
						НадоСписатьСумму = НадоСписатьСумму - мСтоимость;
						НадоСписатьСуммуУпр = НадоСписатьСуммуУпр - мСтоимостьУпр;
						
					Иначе
						НоваяСтрока = ТаблицаДляСписанияГСМ.Добавить();
						НоваяСтрока.ТС = ВыборкаЗапросаПоГСМ.ТС;
						НоваяСтрока.Дата = ВыборкаЗапросаПоГСМ.Дата;
						НоваяСтрока.Партия = Неопределено;
						НоваяСтрока.ГСМ = ВыборкаЗапросаПоГСМ.ГСМ;
						НоваяСтрока.Колонна = ВыборкаЗапросаПоГСМ.Колонна;
						НоваяСтрока.Количество = НадоСписатьКоличество;
						НоваяСтрока.Стоимость = НадоСписатьСумму;	
						НоваяСтрока.СтоимостьУпр = НадоСписатьСуммуУпр;
						
						НадоСписатьКоличество = 0;
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
		КонецЦикла;
		
		вхСредняяЦена = ?(мСписаноКоличество=0, 0,окр(мСписаноСтоимость / мСписаноКоличество,2));
		
	Иначе
		
		//заполняем таблицу по движениям регистра документа. Стоимость ГСМ берем из регистра
		
		РезультатЗапросаПоГСМ 		= Новый Запрос();
		РезультатЗапросаПоГСМ.Текст	=
		"ВЫБРАТЬ
		|	уатОстаткиГСМнаТС.ТС,
		|	уатОстаткиГСМнаТС.ГСМ,
		|	уатОстаткиГСМнаТС.Колонна,
		|	уатОстаткиГСМнаТС.Организация,
		|	уатОстаткиГСМнаТС.Подразделение,
		|	уатОстаткиГСМнаТС.Количество,
		|	уатОстаткиГСМнаТС.Стоимость,
		|	уатОстаткиГСМнаТС.СтоимостьУпр
		|ИЗ
		|	РегистрНакопления.уатОстаткиГСМнаТС КАК уатОстаткиГСМнаТС
		|ГДЕ
		|	уатОстаткиГСМнаТС.Регистратор = &Ссылка";
		РезультатЗапросаПоГСМ.УстановитьПараметр("Ссылка",ДокументОбъект.Ссылка);
		
		ВыборкаЗапросаПоГСМ = РезультатЗапросаПоГСМ.Выполнить().Выбрать();
		
		//Перебираем строки ГСМ, который надо списать
		Пока ВыборкаЗапросаПоГСМ.Следующий() Цикл
			НоваяСтрока = ТаблицаДляСписанияГСМ.Добавить();
			НоваяСтрока.ТС = ВыборкаЗапросаПоГСМ.ТС;
			НоваяСтрока.ГСМ = ВыборкаЗапросаПоГСМ.ГСМ;
			НоваяСтрока.Колонна = ВыборкаЗапросаПоГСМ.Колонна;
			НоваяСтрока.Организация = ВыборкаЗапросаПоГСМ.Организация;
			НоваяСтрока.Подразделение = ВыборкаЗапросаПоГСМ.Подразделение;
			НоваяСтрока.Количество = ВыборкаЗапросаПоГСМ.Количество;
			НоваяСтрока.Стоимость = ВыборкаЗапросаПоГСМ.Стоимость;
			НоваяСтрока.СтоимостьУпр = ВыборкаЗапросаПоГСМ.СтоимостьУпр;
		КонецЦикла; 
		
	КонецЕсли;
	
	//округляем до точности хранения остатков ГСМ в ТС
	мТочностьОстатковГСМ = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(ДокументОбъект.Организация, ПланыВидовХарактеристик.уатПраваИНастройки.ТочностьОстатковТоплива);
	Для Каждого ТекСтрока Из ТаблицаДляСписанияГСМ Цикл
		ТекСтрока.Количество = Окр(ТекСтрока.Количество, мТочностьОстатковГСМ);
	КонецЦикла;
	
	Возврат ВсеОК;
	
КонецФункции // ПодготовитьТаблицуСписанияГСМ()

//Функция возвращает выборку результата запроса со структурой норм расхода ГСМ
// на указанную дату среза
//
Функция ПолучитьНормыРасходаГСМ(ТС, ЗаданнаяДата, ГСМ, Организация = Неопределено) ЭКСПОРТ
	
	//список ГСМ с учетом аналогов
	СписокГСМ = Новый СписокЗначений;
	СписокГСМ.Добавить(ГСМ);
	
	ТаблицаГСМ = уатОбщегоНазначения.уатПолучитьАналогиГСМ(ГСМ, Перечисления.уатГруппыГСМ.Топливо);
	
	Для Каждого ТекСтрока Из ТаблицаГСМ Цикл
		СписокГСМ.Добавить(ТекСтрока.Аналог);
	КонецЦикла;	
	
	//запрос по ТС
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НормыРасходаГСМ.*
	|ИЗ
	|	РегистрСведений.уатНормыРасходаГСМ.СрезПоследних(
	|		&Период,
	|		МодельТС = &ТС
	|		    И ГСМ В (&СписокГСМ)) КАК НормыРасходаГСМ";
	Запрос.УстановитьПараметр("СписокГСМ", СписокГСМ);
	Запрос.УстановитьПараметр("Период", ЗаданнаяДата);
	Запрос.УстановитьПараметр("ТС", ТС);
	тблНормыТС = Запрос.Выполнить().Выгрузить();
	
	//отбор по организации - чистим лишние строки
	Сч = тблНормыТС.Количество();
	Пока Сч >= 1 Цикл
		Сч = Сч - 1;
		
		ТекСтрока = тблНормыТС[сч];
		Если НЕ ЗначениеЗаполнено(Организация) И ЗначениеЗаполнено(ТекСтрока.Организация) Тогда
			тблНормыТС.Удалить(ТекСтрока);
			Продолжить;
		КонецЕсли;
		Если ЗначениеЗаполнено(Организация) И ЗначениеЗаполнено(ТекСтрока.Организация) И Организация <> ТекСтрока.Организация Тогда
			тблНормыТС.Удалить(ТекСтрока);
			Продолжить;
		КонецЕсли;
		Если ЗначениеЗаполнено(Организация) И НЕ ЗначениеЗаполнено(ТекСтрока.Организация) Тогда
			СтрокаПоискаДоп = тблНормыТС.Найти(Организация, "Организация");
			Если СтрокаПоискаДоп <> Неопределено И СтрокаПоискаДоп <> ТекСтрока Тогда
				тблНормыТС.Удалить(ТекСтрока);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	//если по конкретному ТС не найдены нормы ГСМ, то ищем нормы по модели ТС
	Если тблНормыТС.Количество() = 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НормыРасходаГСМ.*
		|ИЗ
		|	РегистрСведений.уатНормыРасходаГСМ.СрезПоследних(
		|		&Период,
		|		МодельТС = &МодельТС
		|		    И ГСМ В (&СписокГСМ)) КАК НормыРасходаГСМ";
		Запрос.УстановитьПараметр("СписокГСМ", СписокГСМ);
		Запрос.УстановитьПараметр("Период", ЗаданнаяДата);
		Запрос.УстановитьПараметр("МодельТС", ТС.уатМодель);
		тблНормыТС = Запрос.Выполнить().Выгрузить();
	
		//отбор по организации - чистим лишние строки
		Сч = тблНормыТС.Количество();
		Пока Сч >= 1 Цикл
			Сч = Сч - 1;
			
			ТекСтрока = тблНормыТС[сч];
			Если НЕ ЗначениеЗаполнено(Организация) И ЗначениеЗаполнено(ТекСтрока.Организация) Тогда
				тблНормыТС.Удалить(ТекСтрока);
				Продолжить;
			КонецЕсли;
			Если ЗначениеЗаполнено(Организация) И ЗначениеЗаполнено(ТекСтрока.Организация) И Организация <> ТекСтрока.Организация Тогда
				тблНормыТС.Удалить(ТекСтрока);
				Продолжить;
			КонецЕсли;
			Если ЗначениеЗаполнено(Организация) И НЕ ЗначениеЗаполнено(ТекСтрока.Организация) Тогда
				СтрокаПоискаДоп = тблНормыТС.Найти(Организация, "Организация");
				Если СтрокаПоискаДоп <> Неопределено И СтрокаПоискаДоп <> ТекСтрока Тогда
					тблНормыТС.Удалить(ТекСтрока);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	КоличНорм = тблНормыТС.Количество();
	
	НормаРасхода = Новый Структура;
	
	Для каждого ТекКолонка ИЗ тблНормыТС.Колонки Цикл
		Если КоличНорм = 0 Тогда
			Если ТекКолонка.Имя = "ГСМ" Тогда
				НормаРасхода.Вставить("ГСМ", Справочники.Номенклатура.ПустаяСсылка());	
			ИначеЕсли ТекКолонка.Имя = "МодельТС" Тогда
				НормаРасхода.Вставить("МодельТС", Неопределено);	
			ИначеЕсли СтрНайти(ТекКолонка.Имя, "СпециальнаяРабота") <> 0 Тогда
				НормаРасхода.Вставить(ТекКолонка.Имя, Справочники.уатПараметрыВыработки.ПустаяСсылка());
			ИначеЕсли ТекКолонка.Имя = "Организация" Тогда
				НормаРасхода.Вставить("Организация", Справочники.Организации.ПустаяСсылка());	
			//ИначеЕсли ТекКолонка.Имя = "ЛинейнаяНорма"  Тогда
			//	НормаРасхода.Вставить("ЛинейнаяНорма", 0.0001);
			ИначеЕсли ТекКолонка.Имя = "АлгоритмРасчета" Тогда
				НормаРасхода.Вставить("АлгоритмРасчета", Новый ХранилищеЗначения(Неопределено));
			Иначе
				НормаРасхода.Вставить(ТекКолонка.Имя, 0);
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
		Если НЕ ТС.уатМодель.НаличиеСпидометра И ТекКолонка.Имя = "ЛинейнаяНорма" И НЕ ЗначениеЗаполнено(тблНормыТС[0].ЛинейнаяНорма) тогда
			НормаРасхода.Вставить("ЛинейнаяНорма", 0.0001);	
			Продолжить;
		КонецЕсли;
		
		//НормаРасхода.Вставить(ТекКолонка.Имя, ?(ЗначениеЗаполнено(тблНормыТС[0][ТекКолонка.Имя]), тблНормыТС[0][ТекКолонка.Имя], 0));
		НормаРасхода.Вставить(ТекКолонка.Имя, тблНормыТС[0][ТекКолонка.Имя]);
	КонецЦикла;
	
	Возврат НормаРасхода;
КонецФункции // уатПолучитьНормыРасходаГСМ

//Функция возвращает таблицу норм расхода ТЖ на указанную дату среза.
//	Сначала ищет нормы на ТС, если не находит, то продолжает искать по модели ТС.
//
Функция ПолучитьНормыРасходаТЖ(ТС, ЗаданнаяДата, ТЖ = Неопределено) ЭКСПОРТ
	мсвТС = Новый Массив;
	Если ТипЗнч(ТС) = Тип("Массив") Тогда
		Для Каждого ТекТС Из ТС Цикл
			мсвТС.Добавить(ТекТС);
			мсвТС.Добавить(ТекТС.уатМодель);
		КонецЦикла;
	Иначе
		мсвТС.Добавить(ТС);
		мсвТС.Добавить(ТС.уатМодель);
	КонецЕсли;
	
	//запрос по ТС
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НормыРасходаТехническихЖидкостей.Период КАК Период,
	|	ВЫБОР
	|		КОГДА НормыРасходаТехническихЖидкостей.МодельТС ССЫЛКА Справочник.уатМоделиТС
	|			ТОГДА НормыРасходаТехническихЖидкостей.МодельТС
	|		ИНАЧЕ НормыРасходаТехническихЖидкостей.МодельТС.уатМодель
	|	КОНЕЦ КАК МодельТС,
	|	ВЫБОР
	|		КОГДА НормыРасходаТехническихЖидкостей.МодельТС ССЫЛКА Справочник.ТранспортныеСредства
	|			ТОГДА НормыРасходаТехническихЖидкостей.МодельТС
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК ТС,
	|	НормыРасходаТехническихЖидкостей.ГСМ,
	|	НормыРасходаТехническихЖидкостей.Норма,
	|	НормыРасходаТехническихЖидкостей.НормаНаМоточас,
	|	НормыРасходаТехническихЖидкостей.ЛинейнаяНорма,
	|	ВЫБОР
	|		КОГДА НормыРасходаТехническихЖидкостей.Норма = 0
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК НормаНаОснТопливо,
	|	ВЫБОР
	|		КОГДА НормыРасходаТехническихЖидкостей.МодельТС ССЫЛКА Справочник.ТранспортныеСредства
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК Приоритет
	|ИЗ
	|	РегистрСведений.уатНормыРасходаТехническихЖидкостей.СрезПоследних(
	|			&Период,
	|			МодельТС В (&ТСМодели)
	|			//УСЛОВИЕ ТЖ
	|			) КАК НормыРасходаТехническихЖидкостей
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	Запрос.УстановитьПараметр("Период", ЗаданнаяДата);
	Запрос.УстановитьПараметр("ТСМодели", мсвТС);
	Если ЗначениеЗаполнено(ТЖ) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//УСЛОВИЕ ТЖ", " И ГСМ = &ТЖ");
		Запрос.УстановитьПараметр("ТЖ", ТЖ);
	КонецЕсли;
	
	Рез = Запрос.Выполнить().Выгрузить();
	
	//удаляем лишние строки, поскольку приоритет норм для ТС выше, чем для моделей
	мсвСтрокУдалить = Новый Массив;
	Если Рез.Количество() > 1 Тогда
		Для Каждого ТекСтрокаНормы Из Рез Цикл
			//строки с приоритетом = 2 (это модели)
			Если ТекСтрокаНормы.Приоритет = 2 Тогда
				Продолжить;
			КонецЕсли;
			
			мсвСтрокиПоиска = Рез.НайтиСтроки(Новый Структура("МодельТС, ГСМ, Приоритет", ТекСтрокаНормы.МодельТС, ТекСтрокаНормы.ГСМ, 2));
			Для Каждого ТекСтрокаЛишняя Из мсвСтрокиПоиска Цикл //нашли лишние строки по модели
				мсвСтрокУдалить.Добавить(ТекСтрокаЛишняя);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	Для Каждого ТекСтрокаДляУдаления Из мсвСтрокУдалить Цикл
		Рез.Удалить(ТекСтрокаДляУдаления);
	КонецЦикла;
	
	Возврат Рез;
КонецФункции // уатПолучитьНормыРасходаТЖ


//Функция возвращает остаток ТЖ на ТС
// Параметры: МоментВремени - время на которое определяется остаток
// ТС
// ТЖ
//
Функция ОстатокТЖнаТС(ТС, ТЖ, МоментВремени) Экспорт
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР КОГДА (уатОстаткиТЖнаТС.КоличествоОстаток) ЕСТЬ NULL ТОГДА 0 ИНАЧЕ уатОстаткиТЖнаТС.КоличествоОстаток КОНЕЦ КАК Количество
	|ИЗ
	|	РегистрНакопления.уатОстаткиТЖнаТС.Остатки(&Момент, ТЖ В (&ТЖ) И ТС = &ТС) КАК уатОстаткиТЖнаТС
	|
	|";
	
		//получаем аналоги
	тзАналогиГСМ = уатОбщегоНазначения.уатПолучитьАналогиГСМ(ТЖ);
	
	//добавляем к аналогам основное ГСМ
	НоваяСтрока = тзАналогиГСМ.Добавить();
	НоваяСтрока.ГСМ 			= ТЖ;
	НоваяСтрока.Аналог 			= ТЖ;
	
	Запрос.УстановитьПараметр("Момент", МоментВремени);
	Запрос.УстановитьПараметр("ТЖ", тзАналогиГСМ.ВыгрузитьКолонку("Аналог"));

	Запрос.УстановитьПараметр("ТС", ТС);
	
	//управляемая блокировка
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.уатОстаткиТЖнаТС");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("ТЖ", ТЖ);
	ЭлементБлокировки.УстановитьЗначение("ТС", ТС);
	Блокировка.Заблокировать();
	
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	Если ВыборкаЗапроса.Следующий() Тогда
		Результат = ВыборкаЗапроса.Количество;
	Иначе
		Результат = 0;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

//Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоТЖ - результат запроса по табличной части "Материалы",
//  ТаблицаДляСписанияТЖ - Сформированная таблица значений,
//
// Возвращаемое значение:
//  Сформированная таблица значений.
//
Функция ПодготовитьТаблицуСписанияТЖ(ДокументОбъект, ТаблицаДляСписанияТЖ, СтрокаОшибки = "") Экспорт
	
	Перем мСписаноКоличество;
	Перем мСписаноСтоимость;
	
	ВсеОК = Истина;
	мСписаноКоличество = 0;
	мСписаноСтоимость  = 0;
	
	ТаблицаДляСписанияТЖ = Новый ТаблицаЗначений;
	ТаблицаДляСписанияТЖ.Колонки.Добавить("Партия");
	ТаблицаДляСписанияТЖ.Колонки.Добавить("Дата");
	ТаблицаДляСписанияТЖ.Колонки.Добавить("Склад");
	ТаблицаДляСписанияТЖ.Колонки.Добавить("ТЖ");
	ТаблицаДляСписанияТЖ.Колонки.Добавить("Номенклатура");
	ТаблицаДляСписанияТЖ.Колонки.Добавить("ТС");
	ТаблицаДляСписанияТЖ.Колонки.Добавить("Организация");
	ТаблицаДляСписанияТЖ.Колонки.Добавить("Подразделение");
	ТаблицаДляСписанияТЖ.Колонки.Добавить("Колонна");
	ТаблицаДляСписанияТЖ.Колонки.Добавить("Количество");
	ТаблицаДляСписанияТЖ.Колонки.Добавить("Коэффициент");
	ТаблицаДляСписанияТЖ.Колонки.Добавить("Сумма");
	ТаблицаДляСписанияТЖ.Колонки.Добавить("СтоимостьУпр");
	ТаблицаДляСписанияТЖ.Колонки.Добавить("Стоимость");
	
	МоментВремениОстПартий = ДокументОбъект.МоментВремени();
	
	//заполняем таблицу по данным документа. Рассчитываем стоимость ТЖ
	// получим результат запроса по таблице ТЖ в пут. листе
	РезультатЗапросаПоТЖ = Новый Запрос();
	Если ТипЗнч(ДокументОбъект) = Тип("ДокументСсылка.уатПутевойЛист") ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.уатПутевойЛист") Тогда
		РезультатЗапросаПоТЖ.Текст	=
		"ВЫБРАТЬ
		|	РасходГСМ.ТС,
		|	РасходГСМ.ГСМ КАК ТЖ,
		|	РасходГСМ.РасходПоФакту КАК СписываемоеКоличество,
		|	РасходГСМ.РасходПоФакту КАК Количество,
		|	&Коэффициент КАК Коэффициент,
		|	РасходГСМ.Ссылка.Дата
		|ИЗ
		|	Документ.уатПутевойЛист.РасходГСМ КАК РасходГСМ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уатНоменклатураГСМ КАК уатНоменклатураГСМ
		|		ПО РасходГСМ.ГСМ = уатНоменклатураГСМ.Номенклатура
		|			И (уатНоменклатураГСМ.ВестиУчетОстатковТЖ)
		|ГДЕ
		|	РасходГСМ.Ссылка = &Ссылка";
		РезультатЗапросаПоТЖ.УстановитьПараметр("Коэффициент", 1);
		РезультатЗапросаПоТЖ.УстановитьПараметр("Дата", ДокументОбъект.МоментВремени());
		РезультатЗапросаПоТЖ.УстановитьПараметр("Ссылка", ДокументОбъект.Ссылка);
		
		Если ЗначениеЗаполнено(ДокументОбъект.ДатаЗакрытия) Тогда
			МоментВремениОстПартий = Новый Граница(ДокументОбъект.ДатаЗакрытия, ВидГраницы.Исключая);
		КонецЕсли;
		
	Иначе //Документ.уатОперацииСТехническимиЖидкостями
		РезультатЗапросаПоТЖ.Текст	=
		"ВЫБРАТЬ
		|	уатОперацииСТехническимиЖидкостями.ТС,
		|	уатОперацииСТехническимиЖидкостями.Номенклатура КАК ТЖ,
		|	уатОперацииСТехническимиЖидкостями.Ссылка.Склад КАК Склад,
		|	уатОперацииСТехническимиЖидкостями.Количество КАК СписываемоеКоличество,
		|	уатОперацииСТехническимиЖидкостями.Количество КАК Количество,
		|	&Коэффициент КАК Коэффициент,
		|	уатОперацииСТехническимиЖидкостями.Ссылка.Дата
		|ИЗ
		|	Документ.уатОперацииСТехническимиЖидкостями.ТехническиеЖидкости КАК уатОперацииСТехническимиЖидкостями
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уатНоменклатураГСМ КАК уатНоменклатураГСМ
		|		ПО уатОперацииСТехническимиЖидкостями.Номенклатура = уатНоменклатураГСМ.Номенклатура
		|			И (уатНоменклатураГСМ.ВестиУчетОстатковТЖ)
		|ГДЕ
		|	уатОперацииСТехническимиЖидкостями.Ссылка = &Ссылка";
		РезультатЗапросаПоТЖ.УстановитьПараметр("Коэффициент", 1);
		РезультатЗапросаПоТЖ.УстановитьПараметр("Дата", ДокументОбъект.МоментВремени());
		РезультатЗапросаПоТЖ.УстановитьПараметр("Ссылка", ДокументОбъект.Ссылка);
		
	КонецЕсли;
		
	ВыборкаЗапросаПоТЖ = РезультатЗапросаПоТЖ.Выполнить().Выбрать();
		
	СпособОценкиМПЗ = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(ДокументОбъект.Организация, ПланыВидовХарактеристик.уатПраваИНастройки.СпособОценкиМПЗ);
	
	//Перебираем строки ГСМ, который надо списать
	Пока ВыборкаЗапросаПоТЖ.Следующий() Цикл
		НадоСписатьКоличество = ВыборкаЗапросаПоТЖ.СписываемоеКоличество;
		
		//Получение остатков ГСМ по партиям
		РезультатЗапросаПартииТЖ = ПолучитьОстаткиПартийТЖ(МоментВремениОстПартий, СпособОценкиМПЗ, ВыборкаЗапросаПоТЖ.ТС, ВыборкаЗапросаПоТЖ.ТЖ);
		ВыборкаЗапросаПартииТЖ	 = РезультатЗапросаПартииТЖ.Выбрать();
		
		//КоличествоОстаток = ОстатокТЖнаТС(ДокументОбъект.МоментВремени(),
		//	ВыборкаЗапросаПоТЖ.ТС, ВыборкаЗапросаПоТЖ.ТЖ);
		//Если НадоСписатьКоличество > КоличествоОстаток Тогда
		//	//Расход по ТС превышает остаток
		//	ВсеОК=Ложь;
		//	СтрокаОшибки = СтрокаОшибки + Символы.ПС + "Надо списать: " + НадоСписатьКоличество
		//		+ ", остаток: " + КоличествоОстаток;
		//КонецЕсли; 
		
		Если ВсеОК Тогда
			
			НадоСписатьСумму = 0;
			НадоСписатьСуммуУпр = 0;
			Если СпособОценкиМПЗ = Перечисления.СпособыОценки.ПоСредней Тогда
				Попытка
					мТаблицаДляСуммы	= РезультатЗапросаПартииТЖ.Выгрузить();
					НадоСписатьСумму = мТаблицаДляСуммы.Итог("Стоимость") / мТаблицаДляСуммы.Итог("Количество") * НадоСписатьКоличество;
					НадоСписатьСуммуУпр = мТаблицаДляСуммы.Итог("СтоимостьУпр") / мТаблицаДляСуммы.Итог("Количество") * НадоСписатьКоличество;
				Исключение
				КонецПопытки;	
			КонецЕсли;
			
			Пока НадоСписатьКоличество > 0 Цикл
				Если ВыборкаЗапросаПартииТЖ.Следующий() Тогда
					мКоличество = Мин(НадоСписатьКоличество, ВыборкаЗапросаПартииТЖ.Количество);
					мКоличество = ?(мКоличество < 0, 0, мКоличество);
					
					Если СпособОценкиМПЗ = Перечисления.СпособыОценки.ПоСредней Тогда
						мСтоимость = Мин(НадоСписатьСумму, ВыборкаЗапросаПартииТЖ.Стоимость);
						мСтоимостьУпр = Мин(НадоСписатьСуммуУпр, ВыборкаЗапросаПартииТЖ.СтоимостьУпр);
					Иначе
						Если ВыборкаЗапросаПартииТЖ.Количество = 0 Или ВыборкаЗапросаПартииТЖ.Количество < НадоСписатьКоличество Тогда
							мСтоимость = ВыборкаЗапросаПартииТЖ.Стоимость;
							мСтоимостьУпр = ВыборкаЗапросаПартииТЖ.СтоимостьУпр;
						Иначе	
							мСтоимость = НадоСписатьКоличество * ВыборкаЗапросаПартииТЖ.Стоимость / ВыборкаЗапросаПартииТЖ.Количество;
							мСтоимостьУпр = НадоСписатьКоличество * ВыборкаЗапросаПартииТЖ.СтоимостьУпр / ВыборкаЗапросаПартииТЖ.Количество;
							//мСтоимостьУпр = мСтоимость;
						КонецЕсли;
						
					КонецЕсли;      
					
					Если мКоличество > 0 Тогда
						НоваяСтрока = ТаблицаДляСписанияТЖ.Добавить();
						НоваяСтрока.ТС = ВыборкаЗапросаПоТЖ.ТС;
						НоваяСтрока.Дата = ВыборкаЗапросаПоТЖ.Дата;
						НоваяСтрока.Партия = ВыборкаЗапросаПартииТЖ.Партия;
						НоваяСтрока.Организация = ВыборкаЗапросаПартииТЖ.Организация;
						НоваяСтрока.Подразделение = ВыборкаЗапросаПартииТЖ.Подразделение;
						НоваяСтрока.Колонна = ВыборкаЗапросаПартииТЖ.Колонна;
						НоваяСтрока.ТЖ = ВыборкаЗапросаПартииТЖ.ТЖ;
						НоваяСтрока.Количество = мКоличество;
						НоваяСтрока.Стоимость = мСтоимость;	
						НоваяСтрока.СтоимостьУпр = мСтоимостьУпр;
						
						Если НЕ ТипЗнч(ДокументОбъект) = Тип("ДокументСсылка.уатПутевойЛист") И НЕ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.уатПутевойЛист") Тогда 
							НоваяСтрока.Номенклатура = ВыборкаЗапросаПартииТЖ.ТЖ;
							НоваяСтрока.Склад		= ДокументОбъект.Склад;
							НоваяСтрока.Сумма		= мСтоимость;
						КонецЕсли;
						
						мСписаноКоличество 		= мСписаноКоличество + НоваяСтрока.Количество;
						мСписаноСтоимость 		= мСписаноСтоимость + НоваяСтрока.Стоимость;
					КонецЕсли;
					
					НадоСписатьКоличество = НадоСписатьКоличество - мКоличество;
					НадоСписатьСумму = НадоСписатьСумму - мСтоимость;
					НадоСписатьСуммуУпр = НадоСписатьСуммуУпр - мСтоимостьУпр;
					
				Иначе
					НоваяСтрока = ТаблицаДляСписанияТЖ.Добавить();
					НоваяСтрока.ТС = ВыборкаЗапросаПоТЖ.ТС;
					НоваяСтрока.Дата = ВыборкаЗапросаПоТЖ.Дата;
					НоваяСтрока.Партия = Неопределено;
					НоваяСтрока.ТЖ = ВыборкаЗапросаПоТЖ.ТЖ;
					НоваяСтрока.Количество = НадоСписатьКоличество;
					НоваяСтрока.Стоимость = НадоСписатьСумму;	
					НоваяСтрока.СтоимостьУпр = НадоСписатьСуммуУпр;
					
					НадоСписатьКоличество = 0;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
	КонецЦикла;
		
	Возврат ВсеОК;
	
КонецФункции // ПодготовитьТаблицуСписанияГСМ()

// Возвращает результат запроса по остаткам ТЖ по партиям
//
//
Функция ПолучитьОстаткиПартийТЖ(МоментВремени, СпособОценкиМПЗ, ТС, ТЖ)
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	уатОстаткиТЖнаТС.Партия КАК Партия,
	|	уатОстаткиТЖнаТС.Организация КАК Организация,
	|	уатОстаткиТЖнаТС.Подразделение КАК Подразделение,
	|	уатОстаткиТЖнаТС.Колонна КАК Колонна,
	|	уатОстаткиТЖнаТС.ТС КАК ТС,
	|	уатОстаткиТЖнаТС.ТЖ КАК ТЖ,
	|	ЕСТЬNULL(уатОстаткиТЖнаТС.КоличествоОстаток, 0) КАК Количество,
	|	уатОстаткиТЖнаТС.СтоимостьОстаток КАК Стоимость,
	|	уатОстаткиТЖнаТС.СтоимостьУпрОстаток КАК СтоимостьУпр
	|ИЗ
	|	РегистрНакопления.уатОстаткиТЖнаТС.Остатки(
	|		&Момент,
	|		ТЖ В (&ТЖ) И ТС = &ТС) КАК уатОстаткиТЖнаТС
	|ГДЕ
	|	уатОстаткиТЖнаТС.КоличествоОстаток > 0
	|
	|";
	
	Если СпособОценкиМПЗ = Перечисления.СпособыОценки.ФИФО Тогда
		Запрос.Текст = Запрос.Текст + "
		|УПОРЯДОЧИТЬ ПО	уатОстаткиТЖнаТС.Партия.Дата ВОЗР";
	ИначеЕсли СпособОценкиМПЗ = Перечисления.СпособыОценки.ЛИФО Тогда
		Запрос.Текст = Запрос.Текст + "
		|УПОРЯДОЧИТЬ ПО	уатОстаткиТЖнаТС.Партия.Дата УБЫВ";
	КонецЕсли;
	
	//получаем аналоги
	тзАналогиГСМ = уатОбщегоНазначения.уатПолучитьАналогиГСМ(ТЖ);
	
	//добавляем к аналогам основное ГСМ
	НоваяСтрока = тзАналогиГСМ.Добавить();
	НоваяСтрока.ГСМ = ТЖ;
	НоваяСтрока.Аналог = ТЖ;

	Запрос.УстановитьПараметр("Момент", МоментВремени);
	Запрос.УстановитьПараметр("ТЖ", тзАналогиГСМ.ВыгрузитьКолонку("Аналог"));
	Запрос.УстановитьПараметр("ТС", ТС);
	
	//управляемая блокировка
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.уатОстаткиТЖнаТС");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("ТЖ", ТЖ);
	ЭлементБлокировки.УстановитьЗначение("ТС", ТС);
	Блокировка.Заблокировать();
	
	Возврат Запрос.Выполнить();
КонецФункции

//Функция возвращает флаг учета остатков по ТЖ на ТС
//
Функция УчитыватьОстаткиТЖ(ТЖ) Экспорт
	Рез = Ложь;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	уатНоменклатураГСМ.ВестиУчетОстатковТЖ
	|ИЗ
	|	РегистрСведений.уатНоменклатураГСМ КАК уатНоменклатураГСМ
	|ГДЕ
	|	уатНоменклатураГСМ.Номенклатура = &ТЖ");
	Запрос.УстановитьПараметр("ТЖ", ТЖ);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Рез = (Выборка.ВестиУчетОстатковТЖ = Истина);
	КонецЕсли;
	
	Возврат Рез;
КонецФункции

//Функция возвращает истина если номенклатура является ТЖ
//
Функция ЭтоТехническаяЖидкость(Номенклатура) Экспорт
	Рез = Ложь;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	уатНоменклатураГСМ.ВестиУчетОстатковТЖ
	|ИЗ
	|	РегистрСведений.уатНоменклатураГСМ КАК уатНоменклатураГСМ
	|ГДЕ
	|	уатНоменклатураГСМ.Номенклатура = &Номенклатура
	|	И (уатНоменклатураГСМ.ГруппаГСМ = ЗНАЧЕНИЕ(Перечисление.уатГруппыГСМ.ПрисадкиИТехническиеЖидкости)
	|	ИЛИ уатНоменклатураГСМ.ГруппаГСМ = ЗНАЧЕНИЕ(Перечисление.уатГруппыГСМ.Масло))");
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ГруппаГСМ", Перечисления.уатГруппыГСМ.ПрисадкиИТехническиеЖидкости);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка.Следующий();
КонецФункции

// Процедура создает пакет документов Слив ГСМ по инвентаризациям
//
Процедура ПакетныйВводСливовГСМ(мсвДокументыИнвентаризации) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("мсвДокументыИнвентаризации", мсвДокументыИнвентаризации);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	уатИнвентаризацияГСМвТСГСМвТС.Ссылка,
	|	уатИнвентаризацияГСМвТСГСМвТС.ГСМ,
	|	уатИнвентаризацияГСМвТСГСМвТС.ТС,
	|	СУММА(уатИнвентаризацияГСМвТСГСМвТС.КоличествоУчет - уатИнвентаризацияГСМвТСГСМвТС.Количество) КАК КоличествоОтклонениеИнвентаризации,
	|	уатИнвентаризацияГСМвТС.АЗС,
	|	уатИнвентаризацияГСМвТСГСМвТС.НомерСтроки,
	|	уатИнвентаризацияГСМвТС.Организация,
	|	уатИнвентаризацияГСМвТС.Ответственный,
	|	уатИнвентаризацияГСМвТС.Дата
	|ПОМЕСТИТЬ ДокИнвентаризации
	|ИЗ
	|	Документ.уатИнвентаризацияГСМвТС.ГСМвТС КАК уатИнвентаризацияГСМвТСГСМвТС
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уатИнвентаризацияГСМвТС КАК уатИнвентаризацияГСМвТС
	|		ПО уатИнвентаризацияГСМвТСГСМвТС.Ссылка = уатИнвентаризацияГСМвТС.Ссылка
	|ГДЕ
	|	уатИнвентаризацияГСМвТСГСМвТС.Ссылка В(&мсвДокументыИнвентаризации)
	|	И уатИнвентаризацияГСМвТСГСМвТС.КоличествоУчет - уатИнвентаризацияГСМвТСГСМвТС.Количество > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	уатИнвентаризацияГСМвТСГСМвТС.Ссылка,
	|	уатИнвентаризацияГСМвТСГСМвТС.ГСМ,
	|	уатИнвентаризацияГСМвТСГСМвТС.ТС,
	|	уатИнвентаризацияГСМвТС.АЗС,
	|	уатИнвентаризацияГСМвТСГСМвТС.НомерСтроки,
	|	уатИнвентаризацияГСМвТС.Организация,
	|	уатИнвентаризацияГСМвТС.Ответственный,
	|	уатИнвентаризацияГСМвТС.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокИнвентаризации.Ссылка КАК Ссылка,
	|	ДокИнвентаризации.ГСМ,
	|	ДокИнвентаризации.ТС,
	|	МАКСИМУМ(ДокИнвентаризации.КоличествоОтклонениеИнвентаризации) КАК КоличествоОтклонениеИнвентаризации,
	|	ДокИнвентаризации.АЗС,
	|	СУММА(ВЫБОР
	|			КОГДА уатСливГСМ.Количество ЕСТЬ NULL 
	|				ТОГДА 0
	|			ИНАЧЕ уатСливГСМ.Количество
	|		КОНЕЦ) КАК КоличествоСписанное,
	|	ДокИнвентаризации.Организация,
	|	ДокИнвентаризации.Ответственный,
	|	ДокИнвентаризации.Дата
	|ИЗ
	|	ДокИнвентаризации КАК ДокИнвентаризации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уатСливГСМ КАК уатСливГСМ
	|		ПО ДокИнвентаризации.Ссылка = уатСливГСМ.ДокументОснование
	|			И ДокИнвентаризации.ГСМ = уатСливГСМ.ГСМ
	|			И ДокИнвентаризации.ТС = уатСливГСМ.ТС
	|			И (уатСливГСМ.ДокументОснование В
	|				(ВЫБРАТЬ
	|					ДокИнвентаризации.Ссылка
	|				ИЗ
	|					ДокИнвентаризации КАК ДокИнвентаризации))
	|			И (уатСливГСМ.Проведен)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДокИнвентаризации.Ссылка,
	|	ДокИнвентаризации.ГСМ,
	|	ДокИнвентаризации.ТС,
	|	ДокИнвентаризации.АЗС,
	|	ДокИнвентаризации.НомерСтроки,
	|	ДокИнвентаризации.Организация,
	|	ДокИнвентаризации.Ответственный,
	|	ДокИнвентаризации.Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	ДокИнвентаризации.НомерСтроки";
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда 
		ТекстСообщения = НСтр("ru = 'В выбранных документах отсутствуют ТС с ГСМ, учетное количество которого превышает фактическое.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	флЕстьСозданныеДокументы = Ложь;
	
	Пока Выборка.Следующий() Цикл 
		КоличествоСписать = Выборка.КоличествоОтклонениеИнвентаризации - Выборка.КоличествоСписанное;
		
		Если КоличествоСписать <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не флЕстьСозданныеДокументы Тогда 
			флЕстьСозданныеДокументы = Истина;
		КонецЕсли;
		
		Попытка
			НовДокСписание = Документы.уатСливГСМ.СоздатьДокумент();
		Исключение
			ТекстСообщения = "Ошибка при создании документа." + Символы.ПС + ОписаниеОшибки();
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецПопытки;
		
		уатОбщегоНазначенияТиповые.ЗаполнитьШапкуДокумента(НовДокСписание, ПользователиКлиентСервер.ТекущийПользователь());
		
		НовДокСписание.АЗС               = Выборка.АЗС;
		НовДокСписание.ВидОперации       = Перечисления.уатВидыОперацийСливГСМ.НаСклад;
		НовДокСписание.ГСМ               = Выборка.ГСМ;
		НовДокСписание.ДокументОснование = Выборка.Ссылка;
		НовДокСписание.Количество        = КоличествоСписать;
		НовДокСписание.Организация       = Выборка.Организация;
		НовДокСписание.Ответственный     = Выборка.Ответственный;
		НовДокСписание.ТС                = Выборка.ТС;
		НовДокСписание.Дата              = Выборка.Дата;
		
		Попытка
			НовДокСписание.Записать(РежимЗаписиДокумента.Проведение);
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Создан и проведен документ ""%1 № %2"" для списания ГСМ ""%3"" с ТС ""%4"".'"), 
				НовДокСписание.Ссылка.Метаданные().Представление(),
				НовДокСписание.Ссылка.Номер,
				НовДокСписание.ГСМ,
				НовДокСписание.ТС);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Исключение
			Попытка
				НовДокСписание.Записать(РежимЗаписиДокумента.Запись);
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Создан документ ""%1 № %2"" для списания ГСМ ""%3"" с ТС ""%4"". Документ необходимо провести.'"), 
					НовДокСписание.Ссылка.Метаданные().Представление(),
					НовДокСписание.Ссылка.Номер,
					НовДокСписание.ГСМ,
					НовДокСписание.ТС);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Исключение
				ТекстСообщения = "Ошибка при создании документов """ + НовДокСписание.Ссылка.Метаданные().Представление() + """";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Возврат;
			КонецПопытки;
		КонецПопытки;
	КонецЦикла;
	
	Если Не флЕстьСозданныеДокументы Тогда 
		ТекстСообщения = НСтр("ru = 'В выбранных документах отсутствуют ТС с ГСМ, учетное количество которого превышает фактическое.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

//Функция возвращает список ГСМ по группе ГСМ
//
Функция ПолучитьСписокГСМПоГруппе(ГруппаГСМ) Экспорт 
	СписокГСМ = Новый  СписокЗначений;
	 Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	уатНоменклатураГСМ.Номенклатура
	|ИЗ
	|	РегистрСведений.уатНоменклатураГСМ КАК уатНоменклатураГСМ
	|ГДЕ
	|	уатНоменклатураГСМ.ГруппаГСМ В(&ГруппаГСМ)
	|	И НЕ уатНоменклатураГСМ.Номенклатура.ПометкаУдаления");
	Запрос.УстановитьПараметр("ГруппаГСМ",ГруппаГСМ);
	ВыборкаНом = Запрос.Выполнить().Выбрать();
	Пока ВыборкаНом.Следующий() Цикл
		СписокГСМ.Добавить(ВыборкаНом.Номенклатура);
	КонецЦикла;
	Возврат СписокГСМ;
КонецФункции

//Функция возвращает список ГСМ при автоподборе текста в поле ввода ГСМ
// СтрокаПоиска - подстрока введенного текста
// списокГруппыГСМ - отбор-список групп ГСМ
//
Функция ПолучитьСписокАвтоподбораПоляГСМ(Знач СтрокаПоиска, списокГруппыГСМ = Неопределено, Знач ДопПараметры = Неопределено) Экспорт
	
	ДанныеВыбора = Новый СписокЗначений();
	
	Если СтрокаПоиска = "" Тогда
		Возврат ДанныеВыбора;
	КонецЕсли;
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура;
	КонецЕсли;
	Если НЕ ДопПараметры.Свойство("Организация") Тогда
		ДопПараметры.Вставить("Организация");
	КонецЕсли;
	Если НЕ ДопПараметры.Свойство("БезАналогов") Тогда
		ДопПараметры.Вставить("БезАналогов", Ложь);
	КонецЕсли;
	Если НЕ ДопПараметры.Свойство("УчитыватьТЖ") Тогда
		ДопПараметры.Вставить("УчитыватьТЖ", Ложь);
	КонецЕсли;
	
	//если указано ТС, то отбираем ГСМ только для этого ТС
	Если ДопПараметры.Свойство("ТС") Тогда
		тблВыборка = Новый ТаблицаЗначений;
		тблВыборка.Колонки.Добавить("Номенклатура");
		тблВыборка.Колонки.Добавить("Наименование");
		
		Для Каждого ТекГруппаГСМ Из списокГруппыГСМ Цикл
			ТекмсвГСМ = уатЗащищенныеФункцииСервер.СписокГСМдляТССервер(ДопПараметры.Организация, ДопПараметры.ТС, ТекГруппаГСМ, ДопПараметры.БезАналогов);
			Для Каждого ТекГСМ Из ТекмсвГСМ Цикл
				НоваяСтрока = тблВыборка.Добавить();
				НоваяСтрока.Номенклатура = ТекГСМ.ГСМ;
				НоваяСтрока.Наименование = НоваяСтрока.Номенклатура.Наименование;
			КонецЦикла;
		КонецЦикла;
		
		мсвСтрокУдалить = Новый Массив;
		Для Каждого ТекСтрока Из тблВыборка Цикл
			Если ВРег(Лев(ТекСтрока.Номенклатура.Наименование, СтрДлина(СтрокаПоиска))) <> ВРег(СтрокаПоиска) Тогда
				мсвСтрокУдалить.Добавить(ТекСтрока);
			КонецЕсли;
		КонецЦикла;
		Для Каждого ТекСтрокаУдалить Из мсвСтрокУдалить Цикл
			тблВыборка.Удалить(ТекСтрокаУдалить);
		КонецЦикла;
		
	Иначе //выбираем все ГСМ
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	уатНоменклатураГСМ.Номенклатура,
		|	спрНоменклатура.Наименование
		|ИЗ
		|	РегистрСведений.уатНоменклатураГСМ КАК уатНоменклатураГСМ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК спрНоменклатура
		|		ПО уатНоменклатураГСМ.Номенклатура = спрНоменклатура.Ссылка
		|ГДЕ
		|	НЕ уатНоменклатураГСМ.Номенклатура.ПометкаУдаления
		|	И спрНоменклатура.Наименование ПОДОБНО &СтрокаПодбора");
		Если списокГруппыГСМ <> Неопределено Тогда
			Запрос.Текст = Запрос.Текст + "
			|	И уатНоменклатураГСМ.ГруппаГСМ В(&списокГруппыГСМ)";
			Запрос.УстановитьПараметр("списокГруппыГСМ", списокГруппыГСМ);
		КонецЕсли;
		
		Запрос.УстановитьПараметр("СтрокаПодбора", "" + СтрокаПоиска + "%");
		тблВыборка = Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;
	
	//добавляем ТЖ
	Если ДопПараметры.УчитыватьТЖ Тогда
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	уатНоменклатураГСМ.Номенклатура
		|ИЗ
		|	РегистрСведений.уатНоменклатураГСМ КАК уатНоменклатураГСМ
		|ГДЕ
		|	уатНоменклатураГСМ.ВестиУчетОстатковТЖ
		|	И уатНоменклатураГСМ.Номенклатура.Наименование ПОДОБНО &СтрокаПодбора");
		Запрос.УстановитьПараметр("СтрокаПодбора", "" + СтрокаПоиска + "%");
		тблТЖ = Запрос.Выполнить().Выгрузить();
		Для Каждого ТекСтрока Из тблТЖ Цикл
			Если тблВыборка.Найти(ТекСтрока.Номенклатура, "Номенклатура") = Неопределено Тогда
				НоваяСтрока = тблВыборка.Добавить();
				НоваяСтрока.Номенклатура = ТекСтрока.Номенклатура;
				НоваяСтрока.Наименование = ТекСтрока.Номенклатура.Наименование;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого ТекСтрока Из тблВыборка Цикл 
		врПозицияОтсечения = СтрДлина(СтрокаПоиска);
		тПредставление = Новый ФорматированнаяСтрока(
			Новый ФорматированнаяСтрока(Лев(ТекСтрока.Наименование, врПозицияОтсечения),, WebЦвета.Красный), 
			Новый ФорматированнаяСтрока(Прав(ТекСтрока.Наименование, СтрДлина(ТекСтрока.Наименование)-врПозицияОтсечения)));
		ДанныеВыбора.Добавить(ТекСтрока.Номенклатура, тПредставление);
	КонецЦикла;
	
	Возврат ДанныеВыбора;
	
КонецФункции // ПолучитьСписокАвтоподбораПоляГСМ()


#Область РасчетНормативногоРасходаГСМ

// Функция рассчитывает нормативный расход топлива по ПЛ или МЛ
// ПараметрыРасчета - структура параметров для расчета
//	Возвращает числовое значение.
//	Также возвращает Расшифровку - список всех использованных норм со значениями расхода
//
Функция РасчитатьРасходГСМПоНорме(ПараметрыРасчета, ТС, ГСМ, Отказ = Ложь, Расшифровка = Неопределено) Экспорт
	РасходПоНорме = 0;
	
	//добавление параметров расчета по ТС и ГСМ
	ДобавитьПараметрыРасчетаРасходаГСМПоТС(ПараметрыРасчета, ТС, ГСМ);
	
	Расшифровка = Новый СписокЗначений;	
	Если ТС = ПараметрыРасчета.ТС Тогда
		Если ПараметрыРасчета.НаличиеСпидометра Тогда
			РасходПоНорме = РасходПоНорме + уатЗащищенныеФункцииСервер.РасчитатьРасходГСМЛинейнаяНорма(ПараметрыРасчета, ТС, ГСМ, Отказ, Расшифровка);
		Иначе
			РасходПоНорме = РасходПоНорме + уатЗащищенныеФункцииСервер.РасчитатьРасходГСМНормаСпецНаМоточас(ПараметрыРасчета, ТС, ГСМ, Отказ, Расшифровка);
		КонецЕсли;
		РасходПоНорме = РасходПоНорме + уатЗащищенныеФункцииСервер.РасчитатьРасходГСМНормаНаПростой(ПараметрыРасчета, ТС, ГСМ, Отказ, Расшифровка);
		РасходПоНорме = РасходПоНорме + уатЗащищенныеФункцииСервер.РасчитатьРасходГСМНормаНаТранспРаботу(ПараметрыРасчета, ТС, ГСМ, Отказ, Расшифровка);
		РасходПоНорме = РасходПоНорме + уатЗащищенныеФункцииСервер.РасчитатьРасходГСМНормаНаИзмСобствВеса(ПараметрыРасчета, ТС, ГСМ, Отказ, Расшифровка);
		РасходПоНорме = РасходПоНорме + уатЗащищенныеФункцииСервер.РасчитатьРасходГСМНормаНаЕздки(ПараметрыРасчета, ТС, ГСМ, Отказ, Расшифровка);
		РасходПоНорме = РасходПоНорме + уатЗащищенныеФункцииСервер.РасчитатьРасходГСМНормаНаОперации(ПараметрыРасчета, ТС, ГСМ, Отказ, Расшифровка);
		РасходПоНорме = РасходПоНорме + уатЗащищенныеФункцииСервер.РасчитатьРасходГСМНормаНаЗапуск(ПараметрыРасчета, ТС, ГСМ, Отказ, Расшифровка);
		РасходПоНорме = РасходПоНорме + уатЗащищенныеФункцииСервер.РасчитатьРасходГСМНормаНаОтопитель(ПараметрыРасчета, ТС, ГСМ, Отказ, Расшифровка);
		РасходПоНорме = РасходПоНорме + уатЗащищенныеФункцииСервер.РасчитатьРасходГСМНормыСпецРаботы(ПараметрыРасчета, ТС, ГСМ, Отказ, Расшифровка);
		РасходПоНорме = РасходПоНорме + уатЗащищенныеФункцииСервер.РасчитатьРасходГСМНормаНаОборудование(ПараметрыРасчета, ТС, ГСМ, Отказ, Расшифровка);
	Иначе
		РасходПоНорме = РасходПоНорме + уатЗащищенныеФункцииСервер.РасчитатьРасходГСМНормаСпецНаМоточас(ПараметрыРасчета, ТС, ГСМ, Отказ, Расшифровка);
		РасходПоНорме = РасходПоНорме + уатЗащищенныеФункцииСервер.РасчитатьРасходГСМНормаНаЕздки(ПараметрыРасчета, ТС, ГСМ, Отказ, Расшифровка);
		РасходПоНорме = РасходПоНорме + уатЗащищенныеФункцииСервер.РасчитатьРасходГСМНормаНаОперации(ПараметрыРасчета, ТС, ГСМ, Отказ, Расшифровка);
	КонецЕсли;
	
	РасходПоНорме = Окр(РасходПоНорме, ПараметрыРасчета.ТочностьРасчета);
	
	ОчиститьПараметрыРасчетаРасходаГСМПоТС(ПараметрыРасчета);
	
	Возврат РасходПоНорме;
КонецФункции

Процедура ДобавитьПараметрыРасчетаРасходаГСМПоТС(ПараметрыРасчета, ТС, ГСМ)
	
	Если НЕ ПараметрыРасчета.Свойство("НаличиеСпидометра") Тогда
		ПараметрыРасчета.Вставить("НаличиеСпидометра", ТС.уатМодель.НаличиеСпидометра);
	КонецЕсли;
	
	Если НЕ ПараметрыРасчета.Свойство("НормыРасходаГСМ") Тогда
		НормыРасходаГСМ = ПолучитьНормыРасходаГСМ(ТС, ПараметрыРасчета.ДатаРасчета, ГСМ, ПараметрыРасчета.Организация);
		Для Сч = 1 По 10 Цикл //заполняется флаг "временный" для спец. работ
			НормыРасходаГСМ.Вставить("СпециальнаяРабота" + Сч + "Временный", НормыРасходаГСМ["СпециальнаяРабота" + Сч].Временный);
		КонецЦикла;
		ПараметрыРасчета.Вставить("НормыРасходаГСМ", НормыРасходаГСМ);
	КонецЕсли;
	ПараметрыРасчета.Вставить("КоэффициентСН", ПараметрыРасчета.НормыРасходаГСМ.СезоннаяНадбавка);
	ПараметрыРасчета.Вставить("КоэффициентНК", ПараметрыРасчета.НормыРасходаГСМ.НадбавкаНаКондиционер);
	Если НЕ ПараметрыРасчета.Свойство("КоэффициентТС") Тогда
		ПараметрыРасчета.Вставить("КоэффициентТС", ТС.уатКоэффициентИзмененияНормТоплива);
	КонецЕсли;
	
	Если НЕ ПараметрыРасчета.Свойство("ТССамосвал") Тогда
		Если НЕ ПараметрыРасчета.Свойство("ТССамосвал") Тогда
			Если НЕ ЗначениеЗаполнено(ТС.уатМодель.ТипТС) ИЛИ НЕ ЗначениеЗаполнено(ТС.уатМодель.ТипТС.уатСамосвал) Тогда
				ПараметрыРасчета.Вставить("ТССамосвал", Ложь);
			Иначе
				ПараметрыРасчета.Вставить("ТССамосвал", ТС.уатМодель.ТипТС.уатСамосвал);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если ПараметрыРасчета.ТССамосвал Тогда
		Если НЕ ПараметрыРасчета.Свойство("ТСГрузоподъемность") Тогда
			ПараметрыРасчета.Вставить("ТСГрузоподъемность", ТС.уатМодель.Грузоподъемность);
		КонецЕсли;
		Если НЕ ПараметрыРасчета.Свойство("ТСЗагрузкаСамосвала") Тогда
			ПараметрыРасчета.Вставить("ТСЗагрузкаСамосвала", ТС.уатМодель.НормируемаяЗагрузкаСамосвала);
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ПараметрыРасчета.Свойство("ТССобственныйВес") Тогда
		ПараметрыРасчета.Вставить("ТССобственныйВес", ТС.уатСобственныйВес);
	КонецЕсли;
	Если НЕ ПараметрыРасчета.Свойство("МодельСобственныйВес") Тогда
		ПараметрыРасчета.Вставить("МодельСобственныйВес", ТС.уатМодель.СобственныйВес);
	КонецЕсли;
	
	Если НЕ ПараметрыРасчета.Свойство("АвтоматическиСписыватьРасходТопливаНаЗапуск") Тогда
		ПараметрыРасчета.Вставить("АвтоматическиСписыватьРасходТопливаНаЗапуск", ТС.уатАвтоматическиСписыватьРасходТопливаНаЗапуск);
	КонецЕсли;
	
	Если НЕ ПараметрыРасчета.Свойство("ТСОсновноеТопливо") Тогда
		ПараметрыРасчета.Вставить("ТСОсновноеТопливо", ТС.уатМодель.ОсновноеТопливо);
	КонецЕсли;
		
	//если на входе есть выработка ТС, то берем общую выработку из неё
	//если нет - считаем, что общая выработка уже передана
	Если ПараметрыРасчета.Свойство("ВыработкаТС") Тогда
		ПараметрыРасчета.Вставить("ПробегОбщий", 0);
		ПараметрыРасчета.Вставить("ВремяВРаботе", 0);
		ПараметрыРасчета.Вставить("КоличествоЕздок", 0);
		ПараметрыРасчета.Вставить("КоличествоОпераций", 0);
		ПараметрыРасчета.Вставить("ТранспортнаяРабота", 0);
		ПараметрыРасчета.Вставить("ПробегСГрузом", 0);
		ПараметрыРасчета.Вставить("ВесГруза", 0);
		Для СчСпец = 1 По 10 Цикл
			ПараметрыРасчета.Вставить("КоличествоСпецРаботы" + СчСпец, 0);
		КонецЦикла;
		ПараметрыРасчета.Вставить("СуммаСпецРаботПробег", 0);
		ПараметрыРасчета.Вставить("СуммаСпецРаботВремя", 0);
		
		Для Каждого ТекСтрокаВыработки Из ПараметрыРасчета.ВыработкаТС Цикл
			Если ТекСтрокаВыработки.ТС = ТС Тогда
				Если (ТекСтрокаВыработки.ПараметрВыработки = Справочники.уатПараметрыВыработки.ПробегОбщий) И ПараметрыРасчета.НаличиеСпидометра Тогда
					ПараметрыРасчета.ПробегОбщий = ПараметрыРасчета.ПробегОбщий + ТекСтрокаВыработки.Количество;
				ИначеЕсли ТекСтрокаВыработки.ПараметрВыработки = Справочники.уатПараметрыВыработки.ВремяВРаботе И (НЕ ПараметрыРасчета.НаличиеСпидометра) Тогда
					ПараметрыРасчета.ВремяВРаботе = ПараметрыРасчета.ВремяВРаботе + ТекСтрокаВыработки.Количество;
				ИначеЕсли ТекСтрокаВыработки.ПараметрВыработки = Справочники.уатПараметрыВыработки.КоличествоЕздок Тогда
					ПараметрыРасчета.КоличествоЕздок = ПараметрыРасчета.КоличествоЕздок + ТекСтрокаВыработки.Количество;
				ИначеЕсли ТекСтрокаВыработки.ПараметрВыработки = Справочники.уатПараметрыВыработки.КоличествоОпераций Тогда
					ПараметрыРасчета.КоличествоОпераций = ПараметрыРасчета.КоличествоОпераций + ТекСтрокаВыработки.Количество;
				ИначеЕсли ТекСтрокаВыработки.ПараметрВыработки = Справочники.уатПараметрыВыработки.ТнКм Тогда
					ПараметрыРасчета.ТранспортнаяРабота = ПараметрыРасчета.ТранспортнаяРабота + ТекСтрокаВыработки.Количество;
				ИначеЕсли ТекСтрокаВыработки.ПараметрВыработки = Справочники.уатПараметрыВыработки.ПробегСГрузом Тогда
					ПараметрыРасчета.ПробегСГрузом = ПараметрыРасчета.ПробегСГрузом + ТекСтрокаВыработки.Количество;
				ИначеЕсли ТекСтрокаВыработки.ПараметрВыработки = Справочники.уатПараметрыВыработки.ВесГруза Тогда
					ПараметрыРасчета.ВесГруза = ПараметрыРасчета.ВесГруза + ТекСтрокаВыработки.Количество;
				Иначе
					Для СчСпец = 1 По 10 Цикл
						Если ТекСтрокаВыработки.ПараметрВыработки = ПараметрыРасчета.НормыРасходаГСМ["СпециальнаяРабота" + СчСпец] Тогда
							ПараметрыРасчета["КоличествоСпецРаботы" + СчСпец] = ПараметрыРасчета["КоличествоСпецРаботы" + СчСпец] + ТекСтрокаВыработки.Количество;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если ПараметрыРасчета.КоличествоЕздок = 0 Тогда
			ПараметрыРасчета.КоличествоЕздок = 1;
		КонецЕсли;
				
		//запоминаем пробег и время спецработ, их нужно в дальнейшем отнять от линейной нормы или нормы на м/ч
		Для СчСпец = 1 По 10 Цикл
			ТекКоличествоСпец = ПараметрыРасчета["КоличествоСпецРаботы" + СчСпец];
			Если ТекКоличествоСпец > 0 Тогда
				Если ПараметрыРасчета.НормыРасходаГСМ["СпециальнаяРабота" + СчСпец].Временный Тогда
					ПараметрыРасчета.СуммаСпецРаботВремя = ПараметрыРасчета.СуммаСпецРаботВремя + ТекКоличествоСпец;
				Иначе
					ПараметрыРасчета.СуммаСпецРаботПробег = ПараметрыРасчета.СуммаСпецРаботПробег + ТекКоличествоСпец;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыРасчета.КоэффициентУР) И НЕ ПараметрыРасчета.НаличиеСпидометра И НЕ ПараметрыРасчета.УсловиеРаботыМЧ Тогда
		ПараметрыРасчета.КоэффициентУР = 0;
	КонецЕсли;
	
	Если НЕ ПараметрыРасчета.Свойство("КоэффициентРаботаНаДвухВидахТоплива") Тогда
		КоэффициентРаботаНаДвухВидахТоплива = 1;
		Если ТС = ПараметрыРасчета.ТС И ПараметрыРасчета.РаботаНаДвухВидахТоплива Тогда
			Для Каждого ТекСтрокаГСМ Из ПараметрыРасчета.РасходГСМ Цикл
				Если ТекСтрокаГСМ.ТС = ТС И ТекСтрокаГСМ.ГСМ = ГСМ Тогда
					Если ПараметрыРасчета.НаличиеСпидометра Тогда
						Если ПараметрыРасчета.ПробегОбщий = 0 Тогда
							КоэффициентРаботаНаДвухВидахТоплива = 0;
						Иначе
							КоэффициентРаботаНаДвухВидахТоплива = ТекСтрокаГСМ.Пробег / ПараметрыРасчета.ПробегОбщий;
						КонецЕсли;
					Иначе
						Если ПараметрыРасчета.ВремяВРаботе = 0 Тогда
							КоэффициентРаботаНаДвухВидахТоплива = 0;
						Иначе
							КоэффициентРаботаНаДвухВидахТоплива = ТекСтрокаГСМ.Пробег / (ПараметрыРасчета.ВремяВРаботе/3600);
						КонецЕсли;
					КонецЕсли;
									
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		ПараметрыРасчета.Вставить("КоэффициентРаботаНаДвухВидахТоплива", КоэффициентРаботаНаДвухВидахТоплива);
	КонецЕсли;
	
	ПараметрыРасчета.Вставить("АлгоритмРасчета", ПараметрыРасчета.НормыРасходаГСМ.АлгоритмРасчета.Получить());
	ПараметрыРасчета.Вставить("РасчетПоФормуле", ПараметрыРасчета.АлгоритмРасчета <> Неопределено);
КонецПроцедуры

Процедура ОчиститьПараметрыРасчетаРасходаГСМПоТС(ПараметрыРасчета)
	мсвКлючейУдалить = Новый Массив;
	мсвКлючейУдалить.Добавить("НаличиеСпидометра");
	мсвКлючейУдалить.Добавить("НормыРасходаГСМ");
	мсвКлючейУдалить.Добавить("КоэффициентСН");
	мсвКлючейУдалить.Добавить("КоэффициентТС");
	мсвКлючейУдалить.Добавить("ТССамосвал");
	мсвКлючейУдалить.Добавить("ТСГрузоподъемность");
	мсвКлючейУдалить.Добавить("ТСЗагрузкаСамосвала");
	мсвКлючейУдалить.Добавить("ТССобственныйВес");
	мсвКлючейУдалить.Добавить("ПробегОбщий");
	мсвКлючейУдалить.Добавить("ВремяВРаботе");
	мсвКлючейУдалить.Добавить("КоличествоЕздок");
	мсвКлючейУдалить.Добавить("КоличествоОпераций");
	мсвКлючейУдалить.Добавить("ТранспортнаяРабота");
	мсвКлючейУдалить.Добавить("ПробегСГрузом");
	мсвКлючейУдалить.Добавить("ВесГруза");
	Для СчСпец = 1 По 10 Цикл
		мсвКлючейУдалить.Добавить("КоличествоСпецРаботы" + СчСпец);
	КонецЦикла;
	мсвКлючейУдалить.Добавить("СуммаСпецРаботПробег");
	мсвКлючейУдалить.Добавить("СуммаСпецРаботВремя");
	мсвКлючейУдалить.Добавить("КоэффициентРаботаНаДвухВидахТоплива");
		
	Для Каждого ТекКлючУдалить Из мсвКлючейУдалить Цикл
		Если ПараметрыРасчета.Свойство(ТекКлючУдалить) Тогда
			ПараметрыРасчета.Удалить(ТекКлючУдалить);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
